cask_args appdir: "/Applications"

tap "eddieantonio/eddieantonio"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "jlhonora/lsusb"
tap "sambadevi/powerlevel9k"
tap "go-task/tap"
tap "teamookla/speedtest"
tap "mykolaharmash/git-jump"

# GUI Software
cask "tor-browser"
cask "transmit"
cask "vlc"
cask "alfred"
cask "appcleaner"
cask "avast-security"
cask "google-chrome"
cask "insomnia"
cask "iterm2"
cask "dropbox"
cask "ngrok"
cask "protonvpn"
cask "sequel-ace"
cask "setapp"
cask "skype"
cask "slack"
cask "sublime-text"
cask "suspicious-package"
cask "jetbrains-toolbox"
cask "transmission"
cask "oracle-jdk"
cask "steelseries-engine"
cask "notion"
cask "logitech-options"
cask "microsoft-office"
cask "postman"
cask "pritunl"
cask "iMazing"
cask "1password"
cask "monitorcontrol"

# CLI software
brew "ack"
brew "ccat"
brew "cloc"
brew "coreutils"
brew "thefuck"
brew "ctags"
brew "curl"
brew "dnsmasq"
brew "exa"
brew "ffmpeg"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gd"
brew "git"
brew "go-task"
brew "htop"
brew "httpie"
brew "hub"
brew "inetutils"
brew "jq"
brew "mas"
brew "composer"
brew "phpmd"
brew "pv"
brew "pwgen"
brew "reattach-to-user-namespace"
brew "rsync"
brew "sbt"
brew "screen"
brew "shellcheck"
brew "ssh-copy-id"
brew "tree"
brew "watch"
brew "wget"
brew "wrk"
brew "youtube-dl"
brew "jlhonora/lsusb/lsusb"
brew "brightness"
brew "hadolint"
brew "mycli"
brew "speedtest"
brew "gh"
brew "glab"
brew "qlcolorcode"
brew "qlstephen"
brew "qlmarkdown" 
brew "quicklook-json" 
brew "suspicious-package" 
brew "apparency"
brew "luarocks"
brew "luv"
brew "ripgrep"
brew "kotlin-language-server"

# Languages
# brew "php", restart_service: true, link: true
brew "node"
brew "yarn"
brew "go"
brew "nvm"

# Font face
cask "font-fira-code"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-roboto-mono"
cask "font-source-code-pro-for-powerline"
cask "font-cascadia"
cask "rectangle"

# GUI Software from App Store
mas "Brightness Slider", id: 456624497
mas "DaisyDisk", id: 411643860
mas "Encrypto", id: 935235287
mas "iMazing HEIC Converter", id: 1292198261
mas "iNet Network Scanner", id: 403304796
mas "Parcel", id: 639968404
mas "The Unarchiver", id: 425424353
# mas "Xcode", id: 497799835
