cask_args appdir: "/Applications"

tap "eddieantonio/eddieantonio"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jlhonora/lsusb"
tap "sambadevi/powerlevel9k"
tap "go-task/tap"
tap "teamookla/speedtest"
tap "hashicorp/tap"
tap "shivammathur/php"

# GUI Software
cask "arc"
cask "transmit"
cask "vlc"
cask "raycast"
cask "dropbox"
cask "protonvpn"
cask "sequel-ace"
cask "setapp"
cask "slack"
cask "sublime-text"
cask "microsoft-office"
cask "postman"
cask "1password"
cask "viscosity"
cask "iterm2"
cask "zed"

# Languages
brew "php"
brew "node"
brew "yarn"
brew "go"
brew "nvm"

# CLI software
brew "ack"
brew "ccat"
brew "cloc"
brew "coreutils"
brew "ctags"
brew "curl"
brew "dnsmasq"
brew "eza"
brew "ffmpeg"
brew "scc"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gd"
brew "git"
brew "go-task"
brew "htop"
brew "httpie"
brew "inetutils"
brew "jq"
brew "jd"
brew "mas"
brew "pv"
brew "pwgen"
brew "reattach-to-user-namespace"
brew "rsync"
brew "sbt"
brew "screen"
brew "ripgrep"
brew "shellcheck"
brew "ssh-copy-id"
brew "tree"
brew "glab"
brew "watch"
brew "wget"
brew "wrk"
brew "jlhonora/lsusb/lsusb"
brew "hadolint"
brew "mycli"
brew "speedtest"
brew "luarocks"
brew "luv"
brew "ripgrep"
brew "kotlin-language-server"
brew "gopls"
brew "hashicorp/tap/vault"
brew "joemiller/taps/vault-token-helper"
brew "saml2aws"
brew "qwerty-fr"
brew "colima"
brew "docker"
brew "docker-compose"
brew "openapi-generator"
brew "switchaudio-osx"
brew "openssl"
brew "joshmedeski/sesh/sesh"

# Font face
cask "font-fira-code"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-roboto-mono"
cask "font-source-code-pro-for-powerline"
cask "font-cascadia"

# GUI Software from App Store
mas "Encrypto", id: 935235287
mas "iMazing HEIC Converter", id: 1292198261
mas "iNet Network Scanner", id: 403304796
mas "Parcel", id: 639968404
mas "The Unarchiver", id: 425424353
# mas "Xcode", id: 497799835
