# Taps
tap "hashicorp/tap"
tap "nikitabobko/tap"

# Core Tools
brew "coreutils"
brew "curl"
brew "git"
brew "rsync"
brew "wget"
brew "stow"
brew "just"

# Shell & Terminal
brew "starship"
brew "zoxide"
brew "fzf"
brew "bat"
brew "eza"
brew "ripgrep"
brew "fd"
brew "jq"
brew "tree"
brew "television"
brew "tmux"
brew "yazi"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-completions"

# Development Tools
brew "neovim", args: ["HEAD"]
brew "tree-sitter"
brew "gh"
brew "glab"
brew "httpie"
brew "xh"
brew "docker"
brew "colima", restart_service: :changed
brew "kubectl"
brew "k9s"
brew "uv"
brew "bun"
brew "luajit", args: ["HEAD"]
brew "luarocks"
brew "luv"
brew "ctags"
brew "cloc"
brew "scc"
brew "jd"
brew "jless"

# Languages & Runtimes (Managed via Mise where possible)
brew "mise"
brew "php"
brew "composer"
brew "sbt"

# System & Network
brew "dnsmasq"
brew "htop"
brew "inetutils"
brew "pv"
brew "pwgen"
brew "ssh-copy-id"
brew "sshpass"
brew "switchaudio-osx"
brew "watch"
brew "fswatch"
brew "ffmpeg"

# Casks - Apps
cask "1password"
cask "1password-cli"
cask "arc"
cask "firefox"
cask "ghostty"
cask "zed"
cask "jetbrains-toolbox"
cask "postman"
cask "bruno"
cask "slack"
cask "miro"
cask "vlc"
cask "raycast"
cask "setapp"
cask "logi-options+"
cask "bazecor"
cask "qwerty-fr"
cask "gpg-suite"

# Fonts
cask "font-roboto-mono"
cask "font-source-code-pro-for-powerline"

# Mac App Store (managed via mas)
brew "mas"
mas "1Password for Safari", id: 1569813296
mas "Developer", id: 640199958
mas "iMazing Converter", id: 1292198261
mas "iNet Network Scanner", id: 403304796
mas "Okta Verify", id: 490179405
mas "Parcel Classic", id: 639968404
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
