cask_args appdir: "/Applications"

tap "go-task/tap"
tap "hashicorp/tap"
tap "shivammathur/php"
brew "ack"
brew "ccat"
brew "cloc"
brew "colima", restart_service: :changed
brew "coreutils"
brew "ctags"
brew "curl"
brew "dnsmasq"
brew "docker"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gd"
brew "git"
brew "glab"
brew "go-task"
brew "htop"
brew "httpie"
brew "inetutils"
brew "jd"
brew "jq"
brew "k9s"
brew "luajit", args: ["HEAD"]
brew "luarocks"
brew "luv"
brew "mas"
brew "mise"
brew "neovim", args: ["HEAD"]
brew "node"
brew "nvm"
brew "pv"
brew "pwgen"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rsync"
brew "sbt"
brew "scc"
brew "ssh-copy-id"
brew "sshpass"
brew "stow"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "yarn"
brew "zoxide"
cask "1password"
cask "1password-cli"
cask "arc"
cask "bazecor"
cask "bruno"
cask "dropbox"
cask "firefox"
cask "font-roboto-mono", args: { appdir: "/Applications" }
cask "font-source-code-pro-for-powerline", args: { appdir: "/Applications" }
cask "ghostty"
cask "gpg-suite"
cask "jetbrains-toolbox"
cask "miro"
cask "protonvpn"
cask "qwerty-fr"
cask "raycast"
cask "setapp"
cask "slack"
cask "transmit"
cask "viscosity"
cask "vlc"
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "Developer", id: 640199958
mas "iMazing Converter", id: 1292198261
mas "iNet Network Scanner", id: 403304796
mas "Okta Verify", id: 490179405
mas "Parcel Classic", id: 639968404
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
